In [3]:
import numpy as np
import pandas as pd

# Series

In [3]:
# creating a list of prices of different medicines
med_price_list = [55, 25, 75, 40, 90]

# converting the med_price_list to an array
med_price_arr = np.array(med_price_list)

# converting the list and array into a Pandas Series object
series_list = pd.Series(med_price_list)
series_arr  = pd.Series(med_price_arr)

# printing the converted series object
print(series_list)
print(series_arr)

0    55
1    25
2    75
3    40
4    90
dtype: int64
0    55
1    25
2    75
3    40
4    90
dtype: int32

In [4]:
# printing the converted series object
print(type(series_list))
print(type(series_arr))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [5]:
# changing the index of a series
med_price_list_labeled = pd.Series(
    med_price_list,
    index=["Omeprazole", "Azithromycin", "Metformin", "Ibuprofen", "Cetirizine"])

print(med_price_list_labeled)

Omeprazole      55
Azithromycin    25
Metformin       75
Ibuprofen       40
Cetirizine      90
dtype: int64

In [6]:
# changing the index of a series
med_price_list_labeled = pd.Series(
    med_price_arr,
    index=["Omeprazole", "Azithromycin", "Metformin", "Ibuprofen", "Cetirizine"])

print(med_price_list_labeled)

Omeprazole      55
Azithromycin    25
Metformin       75
Ibuprofen       40
Cetirizine      90
dtype: int32

In [7]:
med_price_list_labeled_updated = med_price_list_labeled + 2.5
med_price_list_labeled_updated

Omeprazole      57.5
Azithromycin    27.5
Metformin       77.5
Ibuprofen       42.5
Cetirizine      92.5
dtype: float64

In [8]:
new_price_list = [77, 45.5, 100, 50, 80]
new_price_list_labeled = pd.Series(
    new_price_list,
    index=["Omeprazole", "Azithromycin", "Metformin", "Ibuprofen", "Cetirizine"]
)
print(new_price_list_labeled)

Omeprazole       77.0
Azithromycin     45.5
Metformin       100.0
Ibuprofen        50.0
Cetirizine       80.0
dtype: float64

In [9]:
print("Difference between new price and old price : ")
print(new_price_list_labeled - med_price_list_labeled_updated)

Difference between new price and old price :
Omeprazole      19.5
Azithromycin    18.0
Metformin       22.5
Ibuprofen        7.5
Cetirizine     -12.5
dtype: float64

# DataFrames

In [10]:
student = ["Mary", "Peter", "Susan", "Toby", "Vishal"]
df1 = pd.DataFrame(student, columns=["Student"])
df1

  Student
0    Mary
1   Peter
2   Susan
3    Toby
4  Vishal

In [11]:
grades = ["B-", "A+", "A-", "B+", "C"]

df2 = pd.DataFrame({"Student" : student, "Grade": grades})
df2

  Student Grade
0    Mary    B-
1   Peter    A+
2   Susan    A-
3    Toby    B+
4  Vishal     C

In [12]:
year = pd.Series([2012, 2013, 2014, 2015, 2016, 2017, 2018])
energy_consumption = pd.Series([2152, 2196, 2217, 2194, 2172, 2180, 2258])

df3 = pd.DataFrame({"Year": year, "Energy_Consumption":energy_consumption})
df3

   Year  Energy_Consumption
0  2012                2152
1  2013                2196
2  2014                2217
3  2015                2194
4  2016                2172
5  2017                2180
6  2018                2258

In [13]:
np.random.randn(10)

array([-0.96370438, -0.1722848 ,  0.04702755, -2.02734133, -0.56167565,
       -0.59201314,  0.14779693, -0.97522048, -0.46630516,  0.10195385])

In [14]:
np.random.randn(5,2)

array([[ 0.00830532, -0.08364286],
       [-1.04195124,  0.28209077],
       [-0.09583484,  0.56739593],
       [ 0.15044541,  0.40556283],
       [ 1.83930686, -0.40401406]])

In [16]:
np.random.randn(5,5,2)

array([[[-0.37016085, -0.36442573],
        [ 0.15405979,  1.06567188],
        [-1.82422803,  0.78540378],
        [ 1.4334312 ,  0.13198086],
        [ 0.79251442, -0.2821535 ]],

       [[ 1.9561422 , -1.28344898],
        [ 1.68849268,  0.49507999],
        [-0.00333747,  0.66714479],
        [-0.87289751,  0.84524552],
        [-0.11102246, -0.23734088]],

       [[-1.09940241, -0.27153479],
        [-1.05778751,  0.90959307],
        [ 1.14351405, -0.85092213],
        [-0.67048458, -0.69877219],
        [ 0.40515049,  0.56048545]],

       [[ 0.51584333,  0.12640641],
        [-0.18251154, -0.05530273],
        [ 0.47257421, -1.51144617],
        [ 0.27075994,  0.66742993],
        [-0.09155388,  0.12297048]],

       [[ 0.24920267,  1.34739536],
        [-0.1904227 , -1.05479535],
        [-0.3461413 ,  0.53182552],
        [-2.63216828, -0.69912052],
        [ 0.58426451,  1.67602195]]])

In [17]:
df4 = pd.DataFrame(np.random.randn(5,2), columns=["Trial 1", "Trial 2"])
df4

    Trial 1   Trial 2
0 -0.549575 -0.938061
1 -0.450962  1.437965
2 -0.815609 -0.191982
3  0.158850 -0.921022
4 -1.098445 -0.806891

In [18]:
df5 = pd.DataFrame(np.random.randn(5,2))
df5

          0         1
0  0.400711 -1.125489
1 -2.477691 -0.843520
2  0.143129 -1.439085
3  0.023385 -1.467680
4 -0.535802 -0.313138

In [19]:
df6 = pd.DataFrame(np.random.randn(5,2), columns=["Trial 1", "Trial 2"], index=["Omeprazole", "Azithromycin", "Metformin", "Ibuprofen", "Cetirizine"])
df6

               Trial 1   Trial 2
Omeprazole    0.758199 -0.740832
Azithromycin -0.355467 -1.234875
Metformin     0.188971  0.390319
Ibuprofen    -0.677471  0.988143
Cetirizine   -0.229906 -0.869237

In [27]:
df6[2:4]

            Trial 1   Trial 2
Metformin  0.188971  0.390319
Ibuprofen -0.677471  0.988143

In [28]:
df6[:3]

               Trial 1   Trial 2
Omeprazole    0.758199 -0.740832
Azithromycin -0.355467 -1.234875
Metformin     0.188971  0.390319

In [30]:
operators = ["AT&T", "Verizon", "T-Mobile US", "US Cellular"]
revenue = [171.76, 128.29, 68.4, 4.04]

telcom = pd.Series(revenue, index=operators)
telcom

AT&T           171.76
Verizon        128.29
T-Mobile US     68.40
US Cellular      4.04
dtype: float64

In [31]:
operators = ["AT&T", "Verizon", "T-Mobile US", "US Cellular"]
revenue = [171.76, 128.29, 68.4, 4.04]

telcom1 = pd.Series(revenue, ["Test"])
telcom1

ValueError: Length of values (4) does not match length of index (1)

In [32]:
operators = ["AT&T", "Verizon", "T-Mobile US", "US Cellular"]
revenue = [171.76, 128.29, 68.4, 4.04]

telcom1 = pd.Series(revenue, operators)
telcom1

AT&T           171.76
Verizon        128.29
T-Mobile US     68.40
US Cellular      4.04
dtype: float64

In [33]:
telcom[0]

171.76

In [34]:
telcom[:3]

AT&T           171.76
Verizon        128.29
T-Mobile US     68.40
dtype: float64

In [35]:
telcom[[0,2,3]]

AT&T           171.76
T-Mobile US     68.40
US Cellular      4.04
dtype: float64

In [36]:
telcom["AT&T"]

171.76

In [38]:
telcom[:"T-Mobile US"]

AT&T           171.76
Verizon        128.29
T-Mobile US     68.40
dtype: float64

In [4]:
# Creating DataFrame using dictionary

store_data = pd.DataFrame(
    {
        "CustomerID": ["CustID00", "CustID01", "CustID02", "CustID03", "CustID04"],
        "location": ["Chicago", "Boston", "Seattle", "San Francisco", "Austin"],
        "gender": ["M", "M", "F", "M", "F"],
        "type": [
            "Electronics",
            "Food&Beverages",
            "Food&Beverages",
            "Medicine",
            "Beauty"
        ],
        "quantity": [1, 3, 4, 2, 1],
        "Total_bill":[100, 75, 125, 50, 80]
    }
)

store_data

  CustomerID       location gender            type  quantity  Total_bill
0   CustID00        Chicago      M     Electronics         1         100
1   CustID01         Boston      M  Food&Beverages         3          75
2   CustID02        Seattle      F  Food&Beverages         4         125
3   CustID03  San Francisco      M        Medicine         2          50
4   CustID04         Austin      F          Beauty         1          80

In [40]:
store_data[:1]

  CustomerID location gender         type  quantity  Total_bill
0   CustID00  Chicago      M  Electronics         1         100

In [41]:
store_data["location"]

0          Chicago
1           Boston
2          Seattle
3    San Francisco
4           Austin
Name: location, dtype: object

In [42]:
np.array(store_data["location"])

array(['Chicago', 'Boston', 'Seattle', 'San Francisco', 'Austin'],
      dtype=object)

In [5]:
store_data

  CustomerID       location gender            type  quantity  Total_bill
0   CustID00        Chicago      M     Electronics         1         100
1   CustID01         Boston      M  Food&Beverages         3          75
2   CustID02        Seattle      F  Food&Beverages         4         125
3   CustID03  San Francisco      M        Medicine         2          50
4   CustID04         Austin      F          Beauty         1          80

In [6]:
store_data.loc[1]

CustomerID          CustID01
location              Boston
gender                     M
type          Food&Beverages
quantity                   3
Total_bill                75
Name: 1, dtype: object

In [7]:
store_data.loc[1,:]

CustomerID          CustID01
location              Boston
gender                     M
type          Food&Beverages
quantity                   3
Total_bill                75
Name: 1, dtype: object

In [8]:
store_data.loc[[1]]

  CustomerID location gender            type  quantity  Total_bill
1   CustID01   Boston      M  Food&Beverages         3          75

In [9]:
store_data.loc[[1,4],["location", "type"]]

  location            type
1   Boston  Food&Beverages
4   Austin          Beauty

In [11]:
store_data.iloc[[1,4],[1, 3]]

  location            type
1   Boston  Food&Beverages
4   Austin          Beauty

In [12]:
store_data.iloc[[1,4],["location", "type"]]

IndexError: .iloc requires numeric indexers, got ['location' 'type']

In [13]:
store_data.iloc[1,4]

3

In [14]:
store_data.iloc[1,3]

'Food&Beverages'

In [15]:
store_data.iloc[1,3] = 'Electronics'

In [16]:
store_data.iloc[1,3]

'Electronics'

In [17]:
store_data

  CustomerID       location gender            type  quantity  Total_bill
0   CustID00        Chicago      M     Electronics         1         100
1   CustID01         Boston      M     Electronics         3          75
2   CustID02        Seattle      F  Food&Beverages         4         125
3   CustID03  San Francisco      M        Medicine         2          50
4   CustID04         Austin      F          Beauty         1          80

# Join DataFrames

3 methods for combining DataFrames
    1. concat
    2. join
    3. merge

In [18]:
data_cust = pd.DataFrame(
    {
        "customerID" : ["101", "102", "103", "104"],
        "category" : ["Medium", "Medium", "High", "Low"],
        "first_visit" : ["yes", "no", "yes", "yes"],
        "sales": [123,52,214,663]
    },
    index=[0,1,2,3]
)


data_cust_new = pd.DataFrame(
    {
        "customerID" : ["101", "103", "104", "105"],
        "distance" : [12, 9, 44, 21],
        "sales": [123,214,663,331]
    },
    index=[4,5,6,7]
)

In [19]:
data_cust

  customerID category first_visit  sales
0        101   Medium         yes    123
1        102   Medium          no     52
2        103     High         yes    214
3        104      Low         yes    663

In [20]:
data_cust_new

  customerID  distance  sales
4        101        12    123
5        103         9    214
6        104        44    663
7        105        21    331

In [22]:
pd.concat([data_cust, data_cust_new], axis=0)

  customerID category first_visit  sales  distance
0        101   Medium         yes    123       NaN
1        102   Medium          no     52       NaN
2        103     High         yes    214       NaN
3        104      Low         yes    663       NaN
4        101      NaN         NaN    123      12.0
5        103      NaN         NaN    214       9.0
6        104      NaN         NaN    663      44.0
7        105      NaN         NaN    331      21.0

In [23]:
pd.concat([data_cust, data_cust_new], axis=1)

  customerID category first_visit  sales customerID  distance  sales
0        101   Medium         yes  123.0        NaN       NaN    NaN
1        102   Medium          no   52.0        NaN       NaN    NaN
2        103     High         yes  214.0        NaN       NaN    NaN
3        104      Low         yes  663.0        NaN       NaN    NaN
4        NaN      NaN         NaN    NaN        101      12.0  123.0
5        NaN      NaN         NaN    NaN        103       9.0  214.0
6        NaN      NaN         NaN    NaN        104      44.0  663.0
7        NaN      NaN         NaN    NaN        105      21.0  331.0

In [24]:
pd.concat([data_cust, data_cust_new])

  customerID category first_visit  sales  distance
0        101   Medium         yes    123       NaN
1        102   Medium          no     52       NaN
2        103     High         yes    214       NaN
3        104      Low         yes    663       NaN
4        101      NaN         NaN    123      12.0
5        103      NaN         NaN    214       9.0
6        104      NaN         NaN    663      44.0
7        105      NaN         NaN    331      21.0

In [25]:
pd.merge( data_cust, data_cust_new, how="outer", on="customerID")

  customerID category first_visit  sales_x  distance  sales_y
0        101   Medium         yes    123.0      12.0    123.0
1        102   Medium          no     52.0       NaN      NaN
2        103     High         yes    214.0       9.0    214.0
3        104      Low         yes    663.0      44.0    663.0
4        105      NaN         NaN      NaN      21.0    331.0

In [26]:
pd.merge( data_cust, data_cust_new, how="inner", on="customerID")

  customerID category first_visit  sales_x  distance  sales_y
0        101   Medium         yes      123        12      123
1        103     High         yes      214         9      214
2        104      Low         yes      663        44      663

In [27]:
pd.merge( data_cust, data_cust_new, how="right", on="customerID")

  customerID category first_visit  sales_x  distance  sales_y
0        101   Medium         yes    123.0        12      123
1        103     High         yes    214.0         9      214
2        104      Low         yes    663.0        44      663
3        105      NaN         NaN      NaN        21      331

In [28]:
pd.merge( data_cust, data_cust_new, how="left", on="customerID")

  customerID category first_visit  sales_x  distance  sales_y
0        101   Medium         yes      123      12.0    123.0
1        102   Medium          no       52       NaN      NaN
2        103     High         yes      214       9.0    214.0
3        104      Low         yes      663      44.0    663.0

In [29]:
data_quarters = pd.DataFrame(
    {"Q1": [101,102,103], "Q2": [201, 202, 203]}, index=["I0", "I1", "I2"]
)
data_quarters_new = pd.DataFrame(
    {"Q3": [301, 302, 303], "Q4": [401, 402, 403]}, index=["I0", "I2", "I3"]
)

In [30]:
data_quarters

     Q1   Q2
I0  101  201
I1  102  202
I2  103  203

In [31]:
data_quarters_new

     Q3   Q4
I0  301  401
I2  302  402
I3  303  403

In [32]:
data_quarters.join(
    data_quarters_new, how="right"
)

       Q1     Q2   Q3   Q4
I0  101.0  201.0  301  401
I2  103.0  203.0  302  402
I3    NaN    NaN  303  403

In [33]:
data

NameError: name 'data' is not defined

In [34]:
data_cust.head()

  customerID category first_visit  sales
0        101   Medium         yes    123
1        102   Medium          no     52
2        103     High         yes    214
3        104      Low         yes    663

In [35]:
data_cust.tail()

  customerID category first_visit  sales
0        101   Medium         yes    123
1        102   Medium          no     52
2        103     High         yes    214
3        104      Low         yes    663

In [36]:
data_cust.shape

(4, 4)

In [37]:
data_cust.info

<bound method DataFrame.info of   customerID category first_visit  sales
0        101   Medium         yes    123
1        102   Medium          no     52
2        103     High         yes    214
3        104      Low         yes    663>

In [38]:
data_cust.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   customerID   4 non-null      object
 1   category     4 non-null      object
 2   first_visit  4 non-null      object
 3   sales        4 non-null      int64
dtypes: int64(1), object(3)
memory usage: 332.0+ bytes

In [39]:
data_cust.dtypes

customerID     object
category       object
first_visit    object
sales           int64
dtype: object

In [40]:
data_cust.dtypes()

TypeError: 'Series' object is not callable